GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_spis.h
/******************************************************************************
*  Filename:       hw_spis.h
*  Revised:        2015-01-15 18:41:47 +0100 (to, 15 jan 2015)
*  Revision:       42400
*
* Copyright (c) 2015, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_SPIS_H__
#define __HW_SPIS_H__


//*****************************************************************************
//
// This section defines the register offsets of
// SPIS component
//
//*****************************************************************************
// SPI Slave General Purpose Flags
#define SPIS_O_GPFLAGS                                              0x00000000

// SPI Slave General Purpose Flags Set
#define SPIS_O_GPFLAGSSET                                           0x00000004

// SPI Slave General Purpose Flags Mask
#define SPIS_O_GPFLAGSMASK                                          0x00000008

// SPI Slave Configuration
#define SPIS_O_CFG                                                  0x0000000C

// SPI Slave TX FIFO Flags Clear
#define SPIS_O_TXFFLAGSCLRN                                         0x00000010

// TX FIFO Flags Set
#define SPIS_O_TXFFLAGSSET                                          0x00000014

// SPI Slave TX FIFO Flags Mask
#define SPIS_O_TXFFLAGSMASK                                         0x00000018

// SPI Slave TX FIFO Status
#define SPIS_O_TXSTAT                                               0x0000001C

// SPI Slave TX FIFO Event Source
#define SPIS_O_TXFEVSRC                                             0x00000020

// SPI Slave TX FIFO Threshold Count
#define SPIS_O_TXFTHR                                               0x00000024

// SPI Slave TX FIFO Push
#define SPIS_O_TXFPUSH                                              0x00000028

// SPI Slave TX FIFO Flush
#define SPIS_O_TXFFLUSH                                             0x0000002C

// SPI Slave TX FIFO Memory Read Pointer
#define SPIS_O_TXFMEMRDPOS                                          0x00000040

// SPI Slave TX FIFO Memory Write Pointer
#define SPIS_O_TXMEMWRPOS                                           0x00000044

// SPI Slave TX FIFO Count
#define SPIS_O_TXFCNT                                               0x00000048

// SPI Slave RX FIFO Flag Clear
#define SPIS_O_RXFFLAGSCLRN                                         0x0000004C

// RX FIFO Flags Set
#define SPIS_O_RXFFLAGSSET                                          0x00000050

// SPI Slave RX FIFO Flags Mask
#define SPIS_O_RXFFLAGSMASK                                         0x00000054

// SPI Slave RX FIFO Status
#define SPIS_O_RXFSTAT                                              0x00000058

// SPI Slave RX FIFO Event Source
#define SPIS_O_RXFEVSRC                                             0x0000005C

// SPI Slave RX FIFO Threshold
#define SPIS_O_RXFTHR                                               0x00000060

// SPI Slave RX FIFO Pop
#define SPIS_O_RXFPOP                                               0x00000064

// SPI Slave RX FIFO Flush
#define SPIS_O_RXFFLUSH                                             0x00000068

// SPI Slave RX FIFO Memory Read Position
#define SPIS_O_RXFMEMRDPOS                                          0x00000080

// SPI Slave RX FIFO Memory Write Position
#define SPIS_O_RXFMEMWRPOS                                          0x00000084

// SPI Slave RX FIFO Byte Count
#define SPIS_O_RXCNT                                                0x00000088

// SPI Slave TX FIFO Memory
#define SPIS_O_TXFMEM0                                              0x00000400

// SPI Slave TX FIFO Memory
#define SPIS_O_TXFMEM1                                              0x00000404

// SPI Slave TX FIFO Memory
#define SPIS_O_TXFMEM2                                              0x00000408

// SPI Slave TX FIFO Memory
#define SPIS_O_TXFMEM3                                              0x0000040C

// SPI Slave TX FIFO Memory
#define SPIS_O_TXFMEM4                                              0x00000410

// SPI Slave TX FIFO Memory
#define SPIS_O_TXFMEM5                                              0x00000414

// SPI Slave TX FIFO Memory
#define SPIS_O_TXFMEM6                                              0x00000418

// SPI Slave TX FIFO Memory
#define SPIS_O_TXFMEM7                                              0x0000041C

// SPI Slave TX FIFO Memory
#define SPIS_O_TXFMEM8                                              0x00000420

// SPI Slave TX FIFO Memory
#define SPIS_O_TXFMEM9                                              0x00000424

// SPI Slave TX FIFO Memory
#define SPIS_O_TXFMEM10                                             0x00000428

// SPI Slave TX FIFO Memory
#define SPIS_O_TXFMEM11                                             0x0000042C

// SPI Slave TX FIFO Memory
#define SPIS_O_TXFMEM12                                             0x00000430

// SPI Slave TX FIFO Memory
#define SPIS_O_TXFMEM13                                             0x00000434

// SPI Slave TX FIFO Memory
#define SPIS_O_TXFMEM14                                             0x00000438

// SPI Slave TX FIFO Memory
#define SPIS_O_TXFMEM15                                             0x0000043C

