GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_spis.h
// Field: [3]    BYTE_DONE
//
// Enable bit for GPFLAGS.BYTE_DONE as event signal.
//
// 0: Flag is not an event source.
// 1: Flag is enabled as an event source.
#define SPIS_GPFLAGSMASK_BYTE_DONE                                  0x00000008
#define SPIS_GPFLAGSMASK_BYTE_DONE_BITN                             3
#define SPIS_GPFLAGSMASK_BYTE_DONE_M                                0x00000008
#define SPIS_GPFLAGSMASK_BYTE_DONE_S                                3

// Field: [2]    BYTE_RX_OVF
//
// Enable bit for GPFLAGS.BYTE_RX_OVF as event signal.
//
// 0: Flag is not an event source.
// 1: Flag is enabled as an event source.
#define SPIS_GPFLAGSMASK_BYTE_RX_OVF                                0x00000004
#define SPIS_GPFLAGSMASK_BYTE_RX_OVF_BITN                           2
#define SPIS_GPFLAGSMASK_BYTE_RX_OVF_M                              0x00000004
#define SPIS_GPFLAGSMASK_BYTE_RX_OVF_S                              2

// Field: [1]    BYTE_ABORT
//
// Enable bit for GPFLAGS.BYTE_ABORT as event signal.
//
// 0: Flag is not an event source.
// 1: Flag is enabled as an event source.
#define SPIS_GPFLAGSMASK_BYTE_ABORT                                 0x00000002
#define SPIS_GPFLAGSMASK_BYTE_ABORT_BITN                            1
#define SPIS_GPFLAGSMASK_BYTE_ABORT_M                               0x00000002
#define SPIS_GPFLAGSMASK_BYTE_ABORT_S                               1

// Field: [0]    CS
//
// Enable bit for GPFLAGS.CS as event signal.
//
// 0: Flag is not an event source.
// 1: Flag is enabled as an event source.
#define SPIS_GPFLAGSMASK_CS                                         0x00000001
#define SPIS_GPFLAGSMASK_CS_BITN                                    0
#define SPIS_GPFLAGSMASK_CS_M                                       0x00000001
#define SPIS_GPFLAGSMASK_CS_S                                       0

//*****************************************************************************
//
// Register: SPIS_O_CFG
//
//*****************************************************************************
// Field: [4]    RX_DMA_REQ_TYPE
//
// RX DMA request type select.
//
// 0: DMA request is chosen.
// 1: Single DMA transfer request is chosen.
#define SPIS_CFG_RX_DMA_REQ_TYPE                                    0x00000010
#define SPIS_CFG_RX_DMA_REQ_TYPE_BITN                               4
#define SPIS_CFG_RX_DMA_REQ_TYPE_M                                  0x00000010
#define SPIS_CFG_RX_DMA_REQ_TYPE_S                                  4

// Field: [3]    TX_DMA_REQ_TYPE
//
// TX DMA request type select.
//
// 0: DMA Request is chosen.
// 1: Single DMA transfer request is chosen.
#define SPIS_CFG_TX_DMA_REQ_TYPE                                    0x00000008
#define SPIS_CFG_TX_DMA_REQ_TYPE_BITN                               3
#define SPIS_CFG_TX_DMA_REQ_TYPE_M                                  0x00000008
#define SPIS_CFG_TX_DMA_REQ_TYPE_S                                  3

// Field: [2]    RX_BIT_ORDER
//
// MOSI first bit configuration.
//
// 0: First bit is LSB.
// 1: First bit is MSB.
#define SPIS_CFG_RX_BIT_ORDER                                       0x00000004
#define SPIS_CFG_RX_BIT_ORDER_BITN                                  2
#define SPIS_CFG_RX_BIT_ORDER_M                                     0x00000004
#define SPIS_CFG_RX_BIT_ORDER_S                                     2

// Field: [1]    TX_BIT_ORDER
//
// MISO first bit configuration.
//
// 0: First bit is LSB.
// 1: First bit is MSB.
#define SPIS_CFG_TX_BIT_ORDER                                       0x00000002
#define SPIS_CFG_TX_BIT_ORDER_BITN                                  1
#define SPIS_CFG_TX_BIT_ORDER_M                                     0x00000002
#define SPIS_CFG_TX_BIT_ORDER_S                                     1

// Field: [0]    POL
//
// SPI clock polarity.
//
// 0: CPOL=0	CPHA=0
// 1: CPOL=1	CPHA=0
#define SPIS_CFG_POL                                                0x00000001
#define SPIS_CFG_POL_BITN                                           0
#define SPIS_CFG_POL_M                                              0x00000001
#define SPIS_CFG_POL_S                                              0

//*****************************************************************************
//
// Register: SPIS_O_TXFFLAGSCLRN
//
//*****************************************************************************
// Field: [6]    OVF
//
// TX FIFO overflow flag.
//
// 0: No TX FIFO overflow.
// 1: TX FIFO overflow due to writing data into a full TX FIFO.
#define SPIS_TXFFLAGSCLRN_OVF                                       0x00000040
#define SPIS_TXFFLAGSCLRN_OVF_BITN                                  6
#define SPIS_TXFFLAGSCLRN_OVF_M                                     0x00000040
#define SPIS_TXFFLAGSCLRN_OVF_S                                     6

// Field: [5]    UNF
//
// TX FIFO underflow flag.
//
// 0: No TX FIFO underflow.
// 1: TX FIFO underflow due to data request from the SPI Slave while TX FIFO is
// empty.
#define SPIS_TXFFLAGSCLRN_UNF                                       0x00000020
#define SPIS_TXFFLAGSCLRN_UNF_BITN                                  5
#define SPIS_TXFFLAGSCLRN_UNF_M                                     0x00000020
#define SPIS_TXFFLAGSCLRN_UNF_S                                     5

// Field: [4]    NOT_EMPTY
//
// TX FIFO has one or more bytes.
//
// 0: Number of bytes in TX FIFO is zero.
// 1: Number of bytes in TX FIFO is greater than zero.
#define SPIS_TXFFLAGSCLRN_NOT_EMPTY                                 0x00000010
#define SPIS_TXFFLAGSCLRN_NOT_EMPTY_BITN                            4
#define SPIS_TXFFLAGSCLRN_NOT_EMPTY_M                               0x00000010
#define SPIS_TXFFLAGSCLRN_NOT_EMPTY_S                               4

// Field: [3]    LE_THR
//
// TX FIFO less than or equal TX FIFO threshold count set by TXFTHR.CNT.
//
// 0: Number of bytes in TX FIFO is greater than the TX FIFO threshold count.
// 1: Number of bytes in TX FIFO is equal or less than TX FIFO threshold count.
//
#define SPIS_TXFFLAGSCLRN_LE_THR                                    0x00000008
#define SPIS_TXFFLAGSCLRN_LE_THR_BITN                               3
#define SPIS_TXFFLAGSCLRN_LE_THR_M                                  0x00000008
#define SPIS_TXFFLAGSCLRN_LE_THR_S                                  3

// Field: [2]    GE_THR
//
// TX FIFO greater than or equal to TX FIFO threshold count set by TXFTHR.CNT.
//
// 0: Number of bytes in TX FIFO is less than TX FIFO threshold count.
// 1: Number of bytes in TX FIFO is equal or greater than TX FIFO threshold
// count.
#define SPIS_TXFFLAGSCLRN_GE_THR                                    0x00000004
#define SPIS_TXFFLAGSCLRN_GE_THR_BITN                               2
#define SPIS_TXFFLAGSCLRN_GE_THR_M                                  0x00000004
#define SPIS_TXFFLAGSCLRN_GE_THR_S                                  2

// Field: [1]    EMPTY
//
// TX FIFO empty flag.
//
// 0: TX FIFO not empty.
// 1: TX FIFO is empty. Attempting to clear the flag while the TX FIFO is empty,
// will result in the flag remaining set.
#define SPIS_TXFFLAGSCLRN_EMPTY                                     0x00000002
#define SPIS_TXFFLAGSCLRN_EMPTY_BITN                                1
#define SPIS_TXFFLAGSCLRN_EMPTY_M                                   0x00000002
#define SPIS_TXFFLAGSCLRN_EMPTY_S                                   1

// Field: [0]    FULL
//
// TX FIFO full flag.
//
// 0: TX FIFO has not become full.
// 1: TX FIFO is full. Attempting to clear this flag while the TX FIFO is full,
// results in the flag remaining set.
#define SPIS_TXFFLAGSCLRN_FULL                                      0x00000001
#define SPIS_TXFFLAGSCLRN_FULL_BITN                                 0
#define SPIS_TXFFLAGSCLRN_FULL_M                                    0x00000001
#define SPIS_TXFFLAGSCLRN_FULL_S                                    0

//*****************************************************************************
//
// Register: SPIS_O_TXFFLAGSSET
//
//*****************************************************************************
// Field: [6]    OVF
//
// TX FIFO overflow flag.
//
// 1: TX FIFO overflow event is forced to 1
#define SPIS_TXFFLAGSSET_OVF                                        0x00000040
#define SPIS_TXFFLAGSSET_OVF_BITN                                   6
#define SPIS_TXFFLAGSSET_OVF_M                                      0x00000040
#define SPIS_TXFFLAGSSET_OVF_S                                      6

// Field: [5]    UNF
//
// TX FIFO underflow flag.
//
// 1: TX FIFO underflow event is forced to 1
#define SPIS_TXFFLAGSSET_UNF                                        0x00000020
#define SPIS_TXFFLAGSSET_UNF_BITN                                   5
#define SPIS_TXFFLAGSSET_UNF_M                                      0x00000020
#define SPIS_TXFFLAGSSET_UNF_S                                      5

// Field: [4]    NOT_EMPTY
//
// TX FIFO has data  flag.
//
// 1: TX FIFO has data event is forced to 1
#define SPIS_TXFFLAGSSET_NOT_EMPTY                                  0x00000010
#define SPIS_TXFFLAGSSET_NOT_EMPTY_BITN                             4
#define SPIS_TXFFLAGSSET_NOT_EMPTY_M                                0x00000010
#define SPIS_TXFFLAGSSET_NOT_EMPTY_S                                4

// Field: [3]    LE_THR
//
// TX FIFO threshold count event.
//
// 1: TX FIFO lower than threshold count event is forced to 1
#define SPIS_TXFFLAGSSET_LE_THR                                     0x00000008
#define SPIS_TXFFLAGSSET_LE_THR_BITN                                3
#define SPIS_TXFFLAGSSET_LE_THR_M                                   0x00000008
#define SPIS_TXFFLAGSSET_LE_THR_S                                   3

// Field: [2]    GE_THR
//
// TX FIFO GE threshold count event.
//
// 1: TX FIFO greater than or equal event is forced to 1
#define SPIS_TXFFLAGSSET_GE_THR                                     0x00000004
#define SPIS_TXFFLAGSSET_GE_THR_BITN                                2
#define SPIS_TXFFLAGSSET_GE_THR_M                                   0x00000004
#define SPIS_TXFFLAGSSET_GE_THR_S                                   2

// Field: [1]    EMPTY
//
// TX FIFO empty event.
//
// 0: No effect
// 1: TX FIFO empty event is forced to 1
#define SPIS_TXFFLAGSSET_EMPTY                                      0x00000002
#define SPIS_TXFFLAGSSET_EMPTY_BITN                                 1
#define SPIS_TXFFLAGSSET_EMPTY_M                                    0x00000002
#define SPIS_TXFFLAGSSET_EMPTY_S                                    1

// Field: [0]    FULL
//
// TX FIFO full event.
//
// 1: TX FIFO full event is forced to 1
#define SPIS_TXFFLAGSSET_FULL                                       0x00000001
#define SPIS_TXFFLAGSSET_FULL_BITN                                  0
#define SPIS_TXFFLAGSSET_FULL_M                                     0x00000001
#define SPIS_TXFFLAGSSET_FULL_S                                     0

//*****************************************************************************
//
// Register: SPIS_O_TXFFLAGSMASK
//
//*****************************************************************************
// Field: [6]    OVF
//
// Enable bit for TXFFLAGSCLRN.OVF as event signal.
//
// 0: Flag is not an event source.
// 1: Flag is enabled as an event source.
#define SPIS_TXFFLAGSMASK_OVF                                       0x00000040
#define SPIS_TXFFLAGSMASK_OVF_BITN                                  6
#define SPIS_TXFFLAGSMASK_OVF_M                                     0x00000040
#define SPIS_TXFFLAGSMASK_OVF_S                                     6

// Field: [5]    UNF
//
// Enable bit for TXFFLAGSCLRN.UNF as event signal.
//
// 0: Flag is not an event source.
// 1: Flag is enabled as an event source.
#define SPIS_TXFFLAGSMASK_UNF                                       0x00000020
#define SPIS_TXFFLAGSMASK_UNF_BITN                                  5
#define SPIS_TXFFLAGSMASK_UNF_M                                     0x00000020
#define SPIS_TXFFLAGSMASK_UNF_S                                     5

// Field: [4]    NOT_EMPTY
//
// Enable bit for TXFFLAGSCLRN.NOT_EMPTY as event signal.
//
// 0: Flag is not an event source.
// 1: Flag is enabled as an event source.
#define SPIS_TXFFLAGSMASK_NOT_EMPTY                                 0x00000010
#define SPIS_TXFFLAGSMASK_NOT_EMPTY_BITN                            4
#define SPIS_TXFFLAGSMASK_NOT_EMPTY_M                               0x00000010
#define SPIS_TXFFLAGSMASK_NOT_EMPTY_S                               4

// Field: [3]    LE_THR
//
// Enable bit for TXFFLAGSCLRN.LE_THR as event signal.
//
// 0: Flag is not an event source.
// 1: Flag is enabled as an event source.
#define SPIS_TXFFLAGSMASK_LE_THR                                    0x00000008
#define SPIS_TXFFLAGSMASK_LE_THR_BITN                               3
#define SPIS_TXFFLAGSMASK_LE_THR_M                                  0x00000008
#define SPIS_TXFFLAGSMASK_LE_THR_S                                  3

// Field: [2]    GE_THR
//
// Enable bit for TXFFLAGSCLRN.GE_THR as event signal.
//
// 0: Flag is not an event source.
// 1: Flag is enabled as an event source.
#define SPIS_TXFFLAGSMASK_GE_THR                                    0x00000004
#define SPIS_TXFFLAGSMASK_GE_THR_BITN                               2
#define SPIS_TXFFLAGSMASK_GE_THR_M                                  0x00000004
#define SPIS_TXFFLAGSMASK_GE_THR_S                                  2

// Field: [1]    EMPTY
//
// Enable bit for TXFFLAGSCLRN.EMPTY as event signal.
//
// 0: Flag is not an event source.
// 1: Flag is enabled as an event source.
#define SPIS_TXFFLAGSMASK_EMPTY                                     0x00000002
#define SPIS_TXFFLAGSMASK_EMPTY_BITN                                1
#define SPIS_TXFFLAGSMASK_EMPTY_M                                   0x00000002
#define SPIS_TXFFLAGSMASK_EMPTY_S                                   1

// Field: [0]    FULL
//
// Enable bit for TXFFLAGSCLRN.FULL as event signal.
//
// 0: Flag is not an event source.
// 1: Flag is enabled as an event source.
#define SPIS_TXFFLAGSMASK_FULL                                      0x00000001
#define SPIS_TXFFLAGSMASK_FULL_BITN                                 0
#define SPIS_TXFFLAGSMASK_FULL_M                                    0x00000001
#define SPIS_TXFFLAGSMASK_FULL_S                                    0

//*****************************************************************************
//
// Register: SPIS_O_TXSTAT
//
//*****************************************************************************
// Field: [4]    NOT_EMPTY
//
// TX FIFO has one or more bytes status.
//
// 0: Number of bytes in TX FIFO is zero (empty).
// 1: Number of bytes in TX FIFO is greater than zero (not empty).
#define SPIS_TXSTAT_NOT_EMPTY                                       0x00000010
#define SPIS_TXSTAT_NOT_EMPTY_BITN                                  4
#define SPIS_TXSTAT_NOT_EMPTY_M                                     0x00000010
#define SPIS_TXSTAT_NOT_EMPTY_S                                     4

// Field: [3]    LE_THR
//
// TX FIFO less than or equal to TX FIFO threshold count set by  TXFTHR.CNT.
//
// 0: Number of bytes in TX FIFO is greater than TX FIFO threshold count.
// 1: Number of bytes in TX FIFO is equal to or less than TX FIFO threshold
// count.
#define SPIS_TXSTAT_LE_THR                                          0x00000008
#define SPIS_TXSTAT_LE_THR_BITN                                     3
#define SPIS_TXSTAT_LE_THR_M                                        0x00000008
#define SPIS_TXSTAT_LE_THR_S                                        3

// Field: [2]    GE_THR
//
// TX FIFO greater than or equal to TX FIFO threshold count set by TXFTHR.CNT.
//
// 0: Number of bytes in TX FIFO is less than TX FIFO threshold count.
// 1: Number of bytes in TX FIFO is equal to or greater than TX FIFO threshold
// count.
#define SPIS_TXSTAT_GE_THR                                          0x00000004
#define SPIS_TXSTAT_GE_THR_BITN                                     2
#define SPIS_TXSTAT_GE_THR_M                                        0x00000004
#define SPIS_TXSTAT_GE_THR_S                                        2

// Field: [1]    EMPTY
//
// TX FIFO empty status.
//
// 0: TX FIFO is not empty.
// 1: TX FIFO is empty.
#define SPIS_TXSTAT_EMPTY                                           0x00000002
#define SPIS_TXSTAT_EMPTY_BITN                                      1
#define SPIS_TXSTAT_EMPTY_M                                         0x00000002
#define SPIS_TXSTAT_EMPTY_S                                         1

// Field: [0]    FULL
//
// TX FIFO full status.
//
// 0: TX FIFO is not full.
// 1: TX FIFO is full.
#define SPIS_TXSTAT_FULL                                            0x00000001
#define SPIS_TXSTAT_FULL_BITN                                       0
#define SPIS_TXSTAT_FULL_M                                          0x00000001
#define SPIS_TXSTAT_FULL_S                                          0

//*****************************************************************************
//
// Register: SPIS_O_TXFEVSRC
//
//*****************************************************************************
// Field: [2:0] SEL
//
// TX FIFO Status event source select
// ENUMs:
// FULL                 TXSTAT.FULL FIFO is full
// EMPTY                TXSTAT.EMPTY FIFO is empty
// GE_THR               TXSTAT.GE_THR FIFO has more data than threshold count
// LE_THR               TXSTAT.LE_THR FIFO has less data than threshold count
// NOT_EMPTY            TXSTAT.NOT_EMPTY FIFO has some data
// ONE                  None
// RESERVED             None
// ZERO                 None
//
#define SPIS_TXFEVSRC_SEL_M                                         0x00000007
#define SPIS_TXFEVSRC_SEL_S                                         0
#define SPIS_TXFEVSRC_SEL_FULL                                      0x00000000
#define SPIS_TXFEVSRC_SEL_EMPTY                                     0x00000001
#define SPIS_TXFEVSRC_SEL_GE_THR                                    0x00000002
#define SPIS_TXFEVSRC_SEL_LE_THR                                    0x00000003
#define SPIS_TXFEVSRC_SEL_NOT_EMPTY                                 0x00000004
#define SPIS_TXFEVSRC_SEL_ONE                                       0x00000005
#define SPIS_TXFEVSRC_SEL_RESERVED                                  0x00000006
#define SPIS_TXFEVSRC_SEL_ZERO                                      0x00000007

//*****************************************************************************
//
// Register: SPIS_O_TXFTHR
//
//*****************************************************************************
// Field: [3:0] CNT
//
// TXFIFO count threshold.
// TXSTAT.LE_THR and TXSTAT.GE_THR depend on this setting.
//
// 0x0: 0 bytes
// 0x1: 1 bytes
// 0x2: 2 bytes
// ...
// 0xE: 14 bytes
// 0xF: 15 bytes
#define SPIS_TXFTHR_CNT_M                                           0x0000000F
#define SPIS_TXFTHR_CNT_S                                           0

//*****************************************************************************
//
// Register: SPIS_O_TXFPUSH
//
//*****************************************************************************
// Field: [7:0] DATA
//
// Data to be pushed into TX FIFO.
#define SPIS_TXFPUSH_DATA_M                                         0x000000FF
#define SPIS_TXFPUSH_DATA_S                                         0

//*****************************************************************************
//
// Register: SPIS_O_TXFFLUSH
//
//*****************************************************************************
// Field: [0]    FLUSH
//
// Execute TX FIFO flush command.
//
// 0: TX FIFO is not flushed (untouched).
// 1: TX FIFO is flushed.
//
#define SPIS_TXFFLUSH_FLUSH                                         0x00000001
#define SPIS_TXFFLUSH_FLUSH_BITN                                    0
#define SPIS_TXFFLUSH_FLUSH_M                                       0x00000001
#define SPIS_TXFFLUSH_FLUSH_S                                       0

//*****************************************************************************
//
// Register: SPIS_O_TXFMEMRDPOS
//
//*****************************************************************************
// Field: [3:0] POS
//
// Read pointer position.
// 0x0: FIFO element #0
// 0x1: FIFO element #1
// ...
// 0xE: FIFO element #14
// 0xF: FIFO element #15
//
//
#define SPIS_TXFMEMRDPOS_POS_M                                      0x0000000F
#define SPIS_TXFMEMRDPOS_POS_S                                      0

//*****************************************************************************
//
// Register: SPIS_O_TXMEMWRPOS
//
//*****************************************************************************
// Field: [3:0] POS
//
// Write pointer position.
// 0x0: FIFO element #0
// 0x1: FIFO element #1
// ...
// 0xE: FIFO element #14
// 0xF: FIFO element #15
//
//
#define SPIS_TXMEMWRPOS_POS_M                                       0x0000000F
#define SPIS_TXMEMWRPOS_POS_S                                       0

//*****************************************************************************
//
// Register: SPIS_O_TXFCNT
//
//*****************************************************************************
// Field: [4:0] CNT
//
// Number of bytes present in the TX FIFO.
//
// 0x00: 0 bytes in FIFO
// 0x01: 1 bytes in FIFO
// ...
// 0x0E: 14 bytes in FIFO
// 0x0F: 15 bytes in FIFO
// 0x10: 16 bytes in FIFO
// 0x11 to 0x1F: Unreachable values
//
//
#define SPIS_TXFCNT_CNT_M                                           0x0000001F
#define SPIS_TXFCNT_CNT_S                                           0

//*****************************************************************************
//
// Register: SPIS_O_RXFFLAGSCLRN
//
//*****************************************************************************
// Field: [6]    OVF
//
// RX FIFO overflow flag.
//
// 0: RX FIFO has no overflow.
// 1: RX FIFO overflow condition.
#define SPIS_RXFFLAGSCLRN_OVF                                       0x00000040
#define SPIS_RXFFLAGSCLRN_OVF_BITN                                  6
#define SPIS_RXFFLAGSCLRN_OVF_M                                     0x00000040
#define SPIS_RXFFLAGSCLRN_OVF_S                                     6

// Field: [5]    UNF
//
// RX FIFO underflow.
//
// 0: RX FIFO has no underflow.
// 1: RX FIFO underflow condition.
#define SPIS_RXFFLAGSCLRN_UNF                                       0x00000020
#define SPIS_RXFFLAGSCLRN_UNF_BITN                                  5
#define SPIS_RXFFLAGSCLRN_UNF_M                                     0x00000020
#define SPIS_RXFFLAGSCLRN_UNF_S                                     5

// Field: [4]    NOT_EMPTY
//
// RX FIFO has one or more bytes.
//
// 0: Number of bytes in RX FIFO equal zero.
// 1: Number of bytes in RX FIFO greater than zero.
//
#define SPIS_RXFFLAGSCLRN_NOT_EMPTY                                 0x00000010
#define SPIS_RXFFLAGSCLRN_NOT_EMPTY_BITN                            4
#define SPIS_RXFFLAGSCLRN_NOT_EMPTY_M                               0x00000010
#define SPIS_RXFFLAGSCLRN_NOT_EMPTY_S                               4

