GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_spis.h
// Field: [3]    LE_THR
//
// RX FIFO less than or equal RX FIFO threshold count.
//
// 0: Number of bytes in RX FIFO not less than or equal RX FIFO threshold count.
// 1: Number of bytes in RX FIFO less than or equal RX FIFO threshold count.
#define SPIS_RXFFLAGSCLRN_LE_THR                                    0x00000008
#define SPIS_RXFFLAGSCLRN_LE_THR_BITN                               3
#define SPIS_RXFFLAGSCLRN_LE_THR_M                                  0x00000008
#define SPIS_RXFFLAGSCLRN_LE_THR_S                                  3

// Field: [2]    GE_THR
//
// RX FIFO greater than or equal to RX FIFO threshold count .
//
// 0: Number of bytes in RX FIFO not  greater than or equal RX FIFO threshold
// count.
// 1: Number of bytes in RX FIFO greater than or equal RX FIFO threshold count.
#define SPIS_RXFFLAGSCLRN_GE_THR                                    0x00000004
#define SPIS_RXFFLAGSCLRN_GE_THR_BITN                               2
#define SPIS_RXFFLAGSCLRN_GE_THR_M                                  0x00000004
#define SPIS_RXFFLAGSCLRN_GE_THR_S                                  2

// Field: [1]    EMPTY
//
// RX FIFO empty flag.
// This flag can not be cleared while the RX FIFO remains empty.
//
// 0: RX FIFO not empty.
// 1: RX FIFO  is empty.
#define SPIS_RXFFLAGSCLRN_EMPTY                                     0x00000002
#define SPIS_RXFFLAGSCLRN_EMPTY_BITN                                1
#define SPIS_RXFFLAGSCLRN_EMPTY_M                                   0x00000002
#define SPIS_RXFFLAGSCLRN_EMPTY_S                                   1

// Field: [0]    FULL
//
// RX FIFO full flag.
// This flag can not be cleared while the RX FIFO remains full.
//
// 0: RX FIFO not  full.
// 1: RX FIFO is full.
#define SPIS_RXFFLAGSCLRN_FULL                                      0x00000001
#define SPIS_RXFFLAGSCLRN_FULL_BITN                                 0
#define SPIS_RXFFLAGSCLRN_FULL_M                                    0x00000001
#define SPIS_RXFFLAGSCLRN_FULL_S                                    0

//*****************************************************************************
//
// Register: SPIS_O_RXFFLAGSSET
//
//*****************************************************************************
// Field: [6]    OVF
//
// RX FIFO overflow flag.
// 1: RX FIFO overflow event is forced to 1
#define SPIS_RXFFLAGSSET_OVF                                        0x00000040
#define SPIS_RXFFLAGSSET_OVF_BITN                                   6
#define SPIS_RXFFLAGSSET_OVF_M                                      0x00000040
#define SPIS_RXFFLAGSSET_OVF_S                                      6

// Field: [5]    UNF
//
// RX FIFO underflow flag.
// 1: RX FIFO underflow event is forced to 1
#define SPIS_RXFFLAGSSET_UNF                                        0x00000020
#define SPIS_RXFFLAGSSET_UNF_BITN                                   5
#define SPIS_RXFFLAGSSET_UNF_M                                      0x00000020
#define SPIS_RXFFLAGSSET_UNF_S                                      5

// Field: [4]    NOT_EMPTY
//
// RX FIFO has data  flag.
// 1: RX FIFO has data event is forced to 1
#define SPIS_RXFFLAGSSET_NOT_EMPTY                                  0x00000010
#define SPIS_RXFFLAGSSET_NOT_EMPTY_BITN                             4
#define SPIS_RXFFLAGSSET_NOT_EMPTY_M                                0x00000010
#define SPIS_RXFFLAGSSET_NOT_EMPTY_S                                4

// Field: [3]    LE_THR
//
// RX FIFO threshold count event.
// 1: RX FIFO lower than threshold count event is forced to 1
#define SPIS_RXFFLAGSSET_LE_THR                                     0x00000008
#define SPIS_RXFFLAGSSET_LE_THR_BITN                                3
#define SPIS_RXFFLAGSSET_LE_THR_M                                   0x00000008
#define SPIS_RXFFLAGSSET_LE_THR_S                                   3

// Field: [2]    GE_THR
//
// RX FIFO GE threshold count event.
// 1: RX FIFO greater than or equal event is forced to 1
#define SPIS_RXFFLAGSSET_GE_THR                                     0x00000004
#define SPIS_RXFFLAGSSET_GE_THR_BITN                                2
#define SPIS_RXFFLAGSSET_GE_THR_M                                   0x00000004
#define SPIS_RXFFLAGSSET_GE_THR_S                                   2

// Field: [1]    EMPTY
//
// RX FIFO empty event.
// 1: RX FIFO empty event is forced to 1
#define SPIS_RXFFLAGSSET_EMPTY                                      0x00000002
#define SPIS_RXFFLAGSSET_EMPTY_BITN                                 1
#define SPIS_RXFFLAGSSET_EMPTY_M                                    0x00000002
#define SPIS_RXFFLAGSSET_EMPTY_S                                    1

// Field: [0]    FULL
//
// RX FIFO full event.
//
// 1: RX FIFO full event is forced to 1
#define SPIS_RXFFLAGSSET_FULL                                       0x00000001
#define SPIS_RXFFLAGSSET_FULL_BITN                                  0
#define SPIS_RXFFLAGSSET_FULL_M                                     0x00000001
#define SPIS_RXFFLAGSSET_FULL_S                                     0

//*****************************************************************************
//
// Register: SPIS_O_RXFFLAGSMASK
//
//*****************************************************************************
// Field: [6]    OVF
//
// Enable bit for RXFFLAGSCLRN.OVF as event signal.
//
// 0: Flag is not an event source.
// 1: Flag is enabled as an event source.
#define SPIS_RXFFLAGSMASK_OVF                                       0x00000040
#define SPIS_RXFFLAGSMASK_OVF_BITN                                  6
#define SPIS_RXFFLAGSMASK_OVF_M                                     0x00000040
#define SPIS_RXFFLAGSMASK_OVF_S                                     6

// Field: [5]    UNF
//
// Enable bit for RXFFLAGSCLRN.UNF as event signal.
//
// 0: Flag is not an event source.
// 1: Flag is enabled as an event source.
#define SPIS_RXFFLAGSMASK_UNF                                       0x00000020
#define SPIS_RXFFLAGSMASK_UNF_BITN                                  5
#define SPIS_RXFFLAGSMASK_UNF_M                                     0x00000020
#define SPIS_RXFFLAGSMASK_UNF_S                                     5

// Field: [4]    NOT_EMPTY
//
// Enable bit for RXFFLAGSCLRN.NOT_EMPTY as event signal.
//
// 0: Flag is not an event source.
// 1: Flag is enabled as an event source.
#define SPIS_RXFFLAGSMASK_NOT_EMPTY                                 0x00000010
#define SPIS_RXFFLAGSMASK_NOT_EMPTY_BITN                            4
#define SPIS_RXFFLAGSMASK_NOT_EMPTY_M                               0x00000010
#define SPIS_RXFFLAGSMASK_NOT_EMPTY_S                               4

// Field: [3]    LE_THR
//
// Enable bit for RXFFLAGSCLRN.LE_THR as event signal.
//
// 0: Flag is not an event source.
// 1: Flag is enabled as an event source.
#define SPIS_RXFFLAGSMASK_LE_THR                                    0x00000008
#define SPIS_RXFFLAGSMASK_LE_THR_BITN                               3
#define SPIS_RXFFLAGSMASK_LE_THR_M                                  0x00000008
#define SPIS_RXFFLAGSMASK_LE_THR_S                                  3

// Field: [2]    GE_THR
//
// Enable bit for RXFFLAGSCLRN.GE_THR as event signal.
//
// 0: Flag is not an event source.
// 1: Flag is enabled as an event source.
#define SPIS_RXFFLAGSMASK_GE_THR                                    0x00000004
#define SPIS_RXFFLAGSMASK_GE_THR_BITN                               2
#define SPIS_RXFFLAGSMASK_GE_THR_M                                  0x00000004
#define SPIS_RXFFLAGSMASK_GE_THR_S                                  2

// Field: [1]    EMPTY
//
// Enable bit for RXFFLAGSCLRN.EMPTY as event signal.
//
// 0: Flag is not an event source.
// 1: Flag is enabled as an event source.
#define SPIS_RXFFLAGSMASK_EMPTY                                     0x00000002
#define SPIS_RXFFLAGSMASK_EMPTY_BITN                                1
#define SPIS_RXFFLAGSMASK_EMPTY_M                                   0x00000002
#define SPIS_RXFFLAGSMASK_EMPTY_S                                   1

// Field: [0]    FULL
//
// Enable bit for RXFFLAGSCLRN.FULL as event signal.
//
// 0: Flag is not an event source.
// 1: Flag is enabled as an event source.
#define SPIS_RXFFLAGSMASK_FULL                                      0x00000001
#define SPIS_RXFFLAGSMASK_FULL_BITN                                 0
#define SPIS_RXFFLAGSMASK_FULL_M                                    0x00000001
#define SPIS_RXFFLAGSMASK_FULL_S                                    0

//*****************************************************************************
//
// Register: SPIS_O_RXFSTAT
//
//*****************************************************************************
// Field: [4]    NOT_EMPTY
//
// RX FIFO has one or more bytes status.
//
// 0: Number of bytes in RX FIFO is zero (empty).
// 1: Number of bytes in RX FIFO is greater than zero (not empty).
#define SPIS_RXFSTAT_NOT_EMPTY                                      0x00000010
#define SPIS_RXFSTAT_NOT_EMPTY_BITN                                 4
#define SPIS_RXFSTAT_NOT_EMPTY_M                                    0x00000010
#define SPIS_RXFSTAT_NOT_EMPTY_S                                    4

// Field: [3]    LE_THR
//
// RX FIFO byte count less than or equal to RX FIFO threshold count  RXFTHR.CNT.
//
// 0: Number of bytes in RX FIFO is greater than RX FIFO threshold count.
// 1: Number of bytes in RX FIFO is equal to or less than RX FIFO threshold
// count.
#define SPIS_RXFSTAT_LE_THR                                         0x00000008
#define SPIS_RXFSTAT_LE_THR_BITN                                    3
#define SPIS_RXFSTAT_LE_THR_M                                       0x00000008
#define SPIS_RXFSTAT_LE_THR_S                                       3

// Field: [2]    GE_THR
//
// RX FIFO byte count greater than or equal to RX FIFO threshold count
// RXFTHR.CNT.
//
// 0: Number of bytes in RX FIFO is less than RX FIFO threshold count.
// 1: Number of bytes in RX FIFO is equal to or greater than RX FIFO threshold
// count.
#define SPIS_RXFSTAT_GE_THR                                         0x00000004
#define SPIS_RXFSTAT_GE_THR_BITN                                    2
#define SPIS_RXFSTAT_GE_THR_M                                       0x00000004
#define SPIS_RXFSTAT_GE_THR_S                                       2

// Field: [1]    EMPTY
//
// RX FIFO empty status.
//
// 0: RX FIFO is not empty.
// 1: RX FIFO is empty.
#define SPIS_RXFSTAT_EMPTY                                          0x00000002
#define SPIS_RXFSTAT_EMPTY_BITN                                     1
#define SPIS_RXFSTAT_EMPTY_M                                        0x00000002
#define SPIS_RXFSTAT_EMPTY_S                                        1

// Field: [0]    FULL
//
// RX FIFO full status.
//
// 0: RX FIFO is not full.
// 1: RX FIFO is full.
#define SPIS_RXFSTAT_FULL                                           0x00000001
#define SPIS_RXFSTAT_FULL_BITN                                      0
#define SPIS_RXFSTAT_FULL_M                                         0x00000001
#define SPIS_RXFSTAT_FULL_S                                         0

//*****************************************************************************
//
// Register: SPIS_O_RXFEVSRC
//
//*****************************************************************************
// Field: [2:0] SEL
//
// RX FIFO Status source select
// ENUMs:
// FULL                 RXFSTAT.FULL FIFO is full
// EMPTY                RXFSTAT.EMPTY FIFO is empty
// GE_THR               RXFSTAT.GE_THR FIFO has more data than threshold count
// LE_THR               RXFSTAT.LE_THR FIFO has less data than threshold count
// NOT_EMPTY            RXFSTAT.NOT_EMPTY FIFO not empty
// ONE                  None
// RESERVED             None
// ZERO                 None
//
#define SPIS_RXFEVSRC_SEL_M                                         0x00000007
#define SPIS_RXFEVSRC_SEL_S                                         0
#define SPIS_RXFEVSRC_SEL_FULL                                      0x00000000
#define SPIS_RXFEVSRC_SEL_EMPTY                                     0x00000001
#define SPIS_RXFEVSRC_SEL_GE_THR                                    0x00000002
#define SPIS_RXFEVSRC_SEL_LE_THR                                    0x00000003
#define SPIS_RXFEVSRC_SEL_NOT_EMPTY                                 0x00000004
#define SPIS_RXFEVSRC_SEL_ONE                                       0x00000005
#define SPIS_RXFEVSRC_SEL_RESERVED                                  0x00000006
#define SPIS_RXFEVSRC_SEL_ZERO                                      0x00000007

//*****************************************************************************
//
// Register: SPIS_O_RXFTHR
//
//*****************************************************************************
// Field: [3:0] CNT
//
// Threshold count.
//
// 0x0: 0 bytes
// 0x1: 1 bytes
// 0x2: 2 bytes
// ...
// 0xE: 14 bytes
// 0xF: 15 bytes
#define SPIS_RXFTHR_CNT_M                                           0x0000000F
#define SPIS_RXFTHR_CNT_S                                           0

//*****************************************************************************
//
// Register: SPIS_O_RXFPOP
//
//*****************************************************************************
// Field: [7:0] DATA
//
// Data read from RX FIFO.
#define SPIS_RXFPOP_DATA_M                                          0x000000FF
#define SPIS_RXFPOP_DATA_S                                          0

//*****************************************************************************
//
// Register: SPIS_O_RXFFLUSH
//
//*****************************************************************************
// Field: [0]    FLUSH
//
// Execute RX FIFO flush command.
//
// 0: RX FIFO is not flushed (untouched).
// 1: RX FIFO is flushed.
//
#define SPIS_RXFFLUSH_FLUSH                                         0x00000001
#define SPIS_RXFFLUSH_FLUSH_BITN                                    0
#define SPIS_RXFFLUSH_FLUSH_M                                       0x00000001
#define SPIS_RXFFLUSH_FLUSH_S                                       0

//*****************************************************************************
//
// Register: SPIS_O_RXFMEMRDPOS
//
//*****************************************************************************
// Field: [3:0] POS
//
// RX FIFO read pointer value.
//
// 0x0: FIFO element #0
// 0x1: FIFO element #1
// ...
// 0xE: Read Pointer at FIFO element #14
// 0xF: Read Pointer at FIFO element #15
//
//
#define SPIS_RXFMEMRDPOS_POS_M                                      0x0000000F
#define SPIS_RXFMEMRDPOS_POS_S                                      0

//*****************************************************************************
//
// Register: SPIS_O_RXFMEMWRPOS
//
//*****************************************************************************
// Field: [3:0] POS
//
// FIFO write pointer value.
// 0x0: FIFO element #0
// 0x1: FIFO element #1
// ...
// 0xE: FIFO element #14
// 0xF: FIFO element #15
//
//
#define SPIS_RXFMEMWRPOS_POS_M                                      0x0000000F
#define SPIS_RXFMEMWRPOS_POS_S                                      0

//*****************************************************************************
//
// Register: SPIS_O_RXCNT
//
//*****************************************************************************
// Field: [4:0] CNT
//
// Number of bytes in present in RX FIFO.
//
// 0x00: 0 bytes in FIFO
// 0x01: 1 bytes in FIFO
// ...
// 0x0E: 14 bytes in FIFO
// 0x0F: 15 bytes in FIFO
// 0x10: 16 bytes in FIFO
// 0x11 to 0x1F: Unreachable values
#define SPIS_RXCNT_CNT_M                                            0x0000001F
#define SPIS_RXCNT_CNT_S                                            0

//*****************************************************************************
//
// Register: SPIS_O_TXFMEM0
//
//*****************************************************************************
// Field: [7:0] DATA
//
// FIFO data element
#define SPIS_TXFMEM0_DATA_M                                         0x000000FF
#define SPIS_TXFMEM0_DATA_S                                         0

//*****************************************************************************
//
// Register: SPIS_O_TXFMEM1
//
//*****************************************************************************
// Field: [7:0] DATA
//
// FIFO data element
#define SPIS_TXFMEM1_DATA_M                                         0x000000FF
#define SPIS_TXFMEM1_DATA_S                                         0

//*****************************************************************************
//
// Register: SPIS_O_TXFMEM2
//
//*****************************************************************************
// Field: [7:0] DATA
//
// FIFO data element
#define SPIS_TXFMEM2_DATA_M                                         0x000000FF
#define SPIS_TXFMEM2_DATA_S                                         0

//*****************************************************************************
//
// Register: SPIS_O_TXFMEM3
//
//*****************************************************************************
// Field: [7:0] DATA
//
// FIFO data element
#define SPIS_TXFMEM3_DATA_M                                         0x000000FF
#define SPIS_TXFMEM3_DATA_S                                         0

//*****************************************************************************
//
// Register: SPIS_O_TXFMEM4
//
//*****************************************************************************
// Field: [7:0] DATA
//
// FIFO data element
#define SPIS_TXFMEM4_DATA_M                                         0x000000FF
#define SPIS_TXFMEM4_DATA_S                                         0

//*****************************************************************************
//
// Register: SPIS_O_TXFMEM5
//
//*****************************************************************************
// Field: [7:0] DATA
//
// FIFO data element
#define SPIS_TXFMEM5_DATA_M                                         0x000000FF
#define SPIS_TXFMEM5_DATA_S                                         0

//*****************************************************************************
//
// Register: SPIS_O_TXFMEM6
//
//*****************************************************************************
// Field: [7:0] DATA
//
// FIFO data element
#define SPIS_TXFMEM6_DATA_M                                         0x000000FF
#define SPIS_TXFMEM6_DATA_S                                         0

//*****************************************************************************
//
// Register: SPIS_O_TXFMEM7
//
//*****************************************************************************
// Field: [7:0] DATA
//
// FIFO data element
#define SPIS_TXFMEM7_DATA_M                                         0x000000FF
#define SPIS_TXFMEM7_DATA_S                                         0

//*****************************************************************************
//
// Register: SPIS_O_TXFMEM8
//
//*****************************************************************************
// Field: [7:0] DATA
//
// FIFO data element
#define SPIS_TXFMEM8_DATA_M                                         0x000000FF
#define SPIS_TXFMEM8_DATA_S                                         0

//*****************************************************************************
//
// Register: SPIS_O_TXFMEM9
//
//*****************************************************************************
// Field: [7:0] DATA
//
// FIFO data element
#define SPIS_TXFMEM9_DATA_M                                         0x000000FF
#define SPIS_TXFMEM9_DATA_S                                         0

//*****************************************************************************
//
// Register: SPIS_O_TXFMEM10
//
//*****************************************************************************
// Field: [7:0] DATA
//
// FIFO data element
#define SPIS_TXFMEM10_DATA_M                                        0x000000FF
#define SPIS_TXFMEM10_DATA_S                                        0

//*****************************************************************************
//
// Register: SPIS_O_TXFMEM11
//
//*****************************************************************************
// Field: [7:0] DATA
//
// FIFO data element
#define SPIS_TXFMEM11_DATA_M                                        0x000000FF
#define SPIS_TXFMEM11_DATA_S                                        0

//*****************************************************************************
//
// Register: SPIS_O_TXFMEM12
//
//*****************************************************************************
// Field: [7:0] DATA
//
// FIFO data element
#define SPIS_TXFMEM12_DATA_M                                        0x000000FF
#define SPIS_TXFMEM12_DATA_S                                        0

//*****************************************************************************
//
// Register: SPIS_O_TXFMEM13
//
//*****************************************************************************
// Field: [7:0] DATA
//
// FIFO data element
#define SPIS_TXFMEM13_DATA_M                                        0x000000FF
#define SPIS_TXFMEM13_DATA_S                                        0

//*****************************************************************************
//
// Register: SPIS_O_TXFMEM14
//
//*****************************************************************************
// Field: [7:0] DATA
//
// FIFO data element
#define SPIS_TXFMEM14_DATA_M                                        0x000000FF
#define SPIS_TXFMEM14_DATA_S                                        0

//*****************************************************************************
//
// Register: SPIS_O_TXFMEM15
//
//*****************************************************************************
// Field: [7:0] DATA
//
// FIFO data element
#define SPIS_TXFMEM15_DATA_M                                        0x000000FF
#define SPIS_TXFMEM15_DATA_S                                        0

//*****************************************************************************
//
// Register: SPIS_O_RXFMEM0
//
//*****************************************************************************
// Field: [7:0] DATA
//
// FIFO data.
#define SPIS_RXFMEM0_DATA_M                                         0x000000FF
#define SPIS_RXFMEM0_DATA_S                                         0

//*****************************************************************************
//
// Register: SPIS_O_RXFMEM1
//
//*****************************************************************************
// Field: [7:0] DATA
//
// FIFO data.
#define SPIS_RXFMEM1_DATA_M                                         0x000000FF
#define SPIS_RXFMEM1_DATA_S                                         0

//*****************************************************************************
//
// Register: SPIS_O_RXFMEM2
//
//*****************************************************************************
// Field: [7:0] DATA
//
// FIFO data.
#define SPIS_RXFMEM2_DATA_M                                         0x000000FF
#define SPIS_RXFMEM2_DATA_S                                         0

